; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p12---int100n150-m25---int100c110---s209---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level6 level6)
(sum level0 level11 level11)
(sum level0 level16 level16)
(sum level0 level19 level19)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level6 level7)
(sum level1 level11 level12)
(sum level1 level16 level17)
(sum level1 level19 level20)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level6 level8)
(sum level2 level11 level13)
(sum level2 level16 level18)
(sum level2 level19 level21)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level6 level9)
(sum level3 level11 level14)
(sum level3 level16 level19)
(sum level3 level19 level22)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level6 level10)
(sum level4 level11 level15)
(sum level4 level16 level20)
(sum level4 level19 level23)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level6 level11)
(sum level5 level11 level16)
(sum level5 level16 level21)
(sum level5 level19 level24)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level6 level12)
(sum level6 level11 level17)
(sum level6 level16 level22)
(sum level6 level19 level25)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level6 level13)
(sum level7 level11 level18)
(sum level7 level16 level23)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level6 level14)
(sum level8 level11 level19)
(sum level8 level16 level24)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level6 level15)
(sum level9 level11 level20)
(sum level9 level16 level25)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level6 level16)
(sum level10 level11 level21)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level6 level17)
(sum level11 level11 level22)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level6 level18)
(sum level12 level11 level23)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level6 level19)
(sum level13 level11 level24)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level6 level20)
(sum level14 level11 level25)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level6 level21)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level6 level22)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level6 level23)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level6 level24)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level6 level25)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level24 level1 level25)

(connected l0 l1)
(fuelcost level2 l0 l1)
(connected l0 l2)
(fuelcost level11 l0 l2)
(connected l0 l3)
(fuelcost level16 l0 l3)
(connected l1 l0)
(fuelcost level2 l1 l0)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l1 l3)
(fuelcost level1 l1 l3)
(connected l2 l0)
(fuelcost level11 l2 l0)
(connected l2 l1)
(fuelcost level6 l2 l1)
(connected l2 l3)
(fuelcost level19 l2 l3)
(connected l3 l0)
(fuelcost level16 l3 l0)
(connected l3 l1)
(fuelcost level1 l3 l1)
(connected l3 l2)
(fuelcost level19 l3 l2)

(at t0 l3)
(fuel t0 level19)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
(at p2 l2)
(at p3 l1)
(at p4 l2)
(at p5 l2)
(at p6 l3)
(at p7 l3)
(at p8 l1)
(at p9 l2)
(at p10 l1)
(at p11 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l3)
(at p3 l2)
(at p4 l0)
(at p5 l1)
(at p6 l0)
(at p7 l2)
(at p8 l0)
(at p9 l1)
(at p10 l3)
(at p11 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 0 of 12
2. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 12
3. (drive t0 l3 l1 level18 level1 level19)
   deleted: (at t0 l3) (fuel t0 level19)
   added: (at t0 l1) (fuel t0 level18)
   goals met: 0 of 12
4. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 12
5. (drive t0 l1 l2 level12 level6 level18)
   deleted: (at t0 l1) (fuel t0 level18)
   added: (at t0 l2) (fuel t0 level12)
   goals met: 0 of 12
6. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 1 of 12
7. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 2 of 12
8. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 2 of 12
9. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 2 of 12
10. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 2 of 12
11. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 2 of 12
12. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 2 of 12
13. (drive t0 l2 l1 level6 level6 level12)
   deleted: (at t0 l2) (fuel t0 level12)
   added: (at t0 l1) (fuel t0 level6)
   goals met: 2 of 12
14. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 3 of 12
15. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 4 of 12
16. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 5 of 12
17. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 5 of 12
18. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 5 of 12
19. (drive t0 l1 l0 level4 level2 level6)
   deleted: (at t0 l1) (fuel t0 level6)
   added: (at t0 l0) (fuel t0 level4)
   goals met: 5 of 12
20. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 5 of 12
21. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 5 of 12
22. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 6 of 12
23. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 7 of 12
24. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 8 of 12
25. (drive t0 l0 l1 level2 level2 level4)
   deleted: (at t0 l0) (fuel t0 level4)
   added: (at t0 l1) (fuel t0 level2)
   goals met: 8 of 12
26. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 9 of 12
27. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 10 of 12
28. (drive t0 l1 l3 level1 level1 level2)
   deleted: (at t0 l1) (fuel t0 level2)
   added: (at t0 l3) (fuel t0 level1)
   goals met: 10 of 12
29. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 11 of 12
30. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 12 of 12
